app/views/videos/like_dislike.js.erb

// 좋아요 버튼 상태 업데이트
<% if @video.video_reactions.exists?(user: current_user, reaction_type: 1) %>
---
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? AND "video_reactions"."reaction_type" = ? LIMIT ?  [["video_id", 2], ["user_id", 2], ["reaction_type", 0], ["LIMIT", 1]]
SELECT 1 AS one FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? AND "video_reactions"."reaction_type" = ? LIMIT ?  [["video_id", 3], ["user_id", 2], ["reaction_type", nil], ["LIMIT", 1]]

// 싫어요 버튼 상태 업데이트
<% if @video.video_reactions.exists?(user: current_user, reaction_type: 0) %>
---
SELECT 1 AS one FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? AND "video_reactions"."reaction_type" = ? LIMIT ?  [["video_id", 3], ["user_id", 2], ["reaction_type", nil], ["LIMIT", 1]]