app/views/videos/show.html.erb

SELECT COUNT(*) FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."reaction_type" = ?  [["video_id", 1], ["reaction_type", 1]]
SELECT COUNT(*) FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."reaction_type" = ?  [["video_id", 1], ["reaction_type", 0]]
---
<!-- 좋아요 / 싫어요 -->
<p>좋아요: <span id="likes-count"><%= @video.video_reactions.where(reaction_type: 1).count %></span> |
   싫어요: <span id="dislikes-count"><%= @video.video_reactions.where(reaction_type: 0).count %></span></p>