app/views/mains/index.html.erb

SELECT "categories".* FROM "categories"
---
          <label for="category">카테고리 선택</label>
          <%= f.select :category, [["옵션 1", "option1"], ["옵션 2", "option2"], ["옵션 3", "option3"]], { prompt: "선택하세요" }, class: "form-control" %>