app/controllers/comments_controller.rb

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "video_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "오 흥미로워요!"], ["user_id", 1], ["video_id", 2], ["created_at", "2024-12-03 16:01:43.456584"], ["updated_at", "2024-12-03 16:01:43.456584"]]
---
  def create
    @video = Video.find(params[:video_id]) # 부모 비디오 찾기
    @comment = @video.comments.build(comment_params) # 댓글 생성
    @comment.user = current_user # 현재 사용자 연결

    if @comment.save