app/controllers/mains_controller.rb

SELECT "mains".* FROM "mains"
SELECT "categories".* FROM "categories"
---
  def index
    @mains = Main.all
	  @categories = Category.all # 드롭다운에 사용할 데이터 로드