app/controllers/pages_controller.rb

SELECT "videos".* FROM "videos" ORDER BY "videos"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
---
  def home
    @videos = Video.all.order(created_at: :desc).limit(10) # 최근 10개의 비디오