app/controllers/videos_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
	@video = Video.find(params[:id])
	# 조회수 증가
  	@video.increment_views!
	# 댓글 목록 불러오기
	@comments = @video.comments.includes(:user)

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_video
    @video = Video.find_by(id: params[:id])