app/controllers/videos_controller.rb

  def show
	# 조회수 증가
  	@video.increment_views!
	# 댓글 목록 불러오기
	@comments = @video.comments.includes(:user)
---
UPDATE "videos" SET "views" = COALESCE("views", 0) + ? WHERE "videos"."id" = ?  [["views", 1], ["id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."video_id" = ?  [["video_id", 2]]

  def set_video
   if params[:id].present?
    @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]