app/controllers/video_reactions_controller.rb

  def like
    reaction = @video.video_reactions.find_or_initialize_by(user: current_user)

    if reaction.reaction_type == 1  # 이미 좋아요라면 취소
      reaction.destroy
    else
      reaction.update(reaction_type: 1)  # 좋아요
      @video.video_reactions.find_by(user: current_user, reaction_type: 0)&.destroy  # 기존 싫어요 취소
---
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? LIMIT ?  [["video_id", 3], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "video_reactions" WHERE "video_reactions"."id" = ?  [["id", 20]]
UPDATE "video_reactions" SET "reaction_type" = ?, "updated_at" = ? WHERE "video_reactions"."id" = ?  [["reaction_type", 1], ["updated_at", "2024-12-03 08:27:50.486042"], ["id", 19]]
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? AND "video_reactions"."reaction_type" = ? LIMIT ?  [["video_id", 3], ["user_id", 2], ["reaction_type", 0], ["LIMIT", 1]]

  def dislike
    reaction = @video.video_reactions.find_or_initialize_by(user: current_user)

    if reaction.reaction_type == 0  # 이미 싫어요라면 취소
      reaction.destroy
    else
      reaction.update(reaction_type: 0)  # 싫어요
      @video.video_reactions.find_by(user: current_user, reaction_type: 1)&.destroy  # 기존 좋아요 취소
---
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? LIMIT ?  [["video_id", 3], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "video_reactions" WHERE "video_reactions"."id" = ?  [["id", 22]]
UPDATE "video_reactions" SET "reaction_type" = ?, "updated_at" = ? WHERE "video_reactions"."id" = ?  [["reaction_type", 0], ["updated_at", "2024-12-03 08:27:49.504708"], ["id", 19]]
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? AND "video_reactions"."reaction_type" = ? LIMIT ?  [["video_id", 3], ["user_id", 2], ["reaction_type", 1], ["LIMIT", 1]]

  def set_video
    @video = Video.find_by(id: params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]