app/controllers/videos_controller.rb

  def index
    @videos = Video.all.order(created_at: :desc) # 최신 순 정렬
---
SELECT "videos".* FROM "videos" ORDER BY "videos"."created_at" DESC

  def search
    if params[:query].present?
      # 검색어와 일치하는 영상 목록
      @videos = Video.where("title LIKE ?", "%#{params[:query]}%")
    else
      @videos = [] # 검색어가 없을 때 빈 배열
    end


    # 검색 결과가 없을 경우 추천 영상 가져오기
    @recommended_videos = Video.order(created_at: :desc).limit(5) if @videos.empty?
---
SELECT "videos".* FROM "videos" WHERE (title LIKE '%비밀세작의집%')
SELECT "videos".* FROM "videos" ORDER BY "videos"."created_at" DESC LIMIT ?  [["LIMIT", 5]]

  def like
    @reaction = @video.video_reactions.find_or_initialize_by(user: current_user)

    if @reaction.new_record?
      @reaction.reaction_type = 1  # 좋아요
      @reaction.save
      @video.increment!(:likes)  # 좋아요 수 증가

      # 만약 싫어요가 이미 눌러져 있다면 취소
      existing_dislike = @video.video_reactions.find_by(user: current_user, reaction_type: 0)
      if existing_dislike
        existing_dislike.destroy
---
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? LIMIT ?  [["video_id", 1], ["user_id", 2], ["LIMIT", 1]]
UPDATE "video_reactions" SET "reaction_type" = ?, "updated_at" = ? WHERE "video_reactions"."id" = ?  [["reaction_type", 0], ["updated_at", "2024-12-01 05:01:09.234338"], ["id", 10]]
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? AND "video_reactions"."reaction_type" = ? LIMIT ?  [["video_id", 1], ["user_id", 2], ["reaction_type", 1], ["LIMIT", 1]]
DELETE FROM "video_reactions" WHERE "video_reactions"."id" = ?  [["id", 3]]

  def dislike
    @reaction = @video.video_reactions.find_or_initialize_by(user: current_user)

    if @reaction.new_record?
      @reaction.reaction_type = 0  # 싫어요
      @reaction.save
      @video.increment!(:dislike)  # 싫어요 수 증가

      # 만약 좋아요가 이미 눌러져 있다면 취소
      existing_like = @video.video_reactions.find_by(user: current_user, reaction_type: 1)
      if existing_like
        existing_like.destroy
---
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? LIMIT ?  [["video_id", 1], ["user_id", 2], ["LIMIT", 1]]
UPDATE "video_reactions" SET "reaction_type" = ?, "updated_at" = ? WHERE "video_reactions"."id" = ?  [["reaction_type", 0], ["updated_at", "2024-12-01 04:48:51.969599"], ["id", 1]]
SELECT "video_reactions".* FROM "video_reactions" WHERE "video_reactions"."video_id" = ? AND "video_reactions"."user_id" = ? AND "video_reactions"."reaction_type" = ? LIMIT ?  [["video_id", 1], ["user_id", 2], ["reaction_type", 1], ["LIMIT", 1]]
DELETE FROM "video_reactions" WHERE "video_reactions"."id" = ?  [["id", 1]]

  def set_video
    @video = Video.find_by(id: params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]