app/models/video.rb

  def increment_views!
    self.increment!(:views)
---
UPDATE "videos" SET "views" = COALESCE("views", 0) + ? WHERE "videos"."id" = ?  [["views", 1], ["id", 3]]