app/controllers/users/registrations_controller.rb

  def create
    Rails.logger.debug "User Params: #{params[:user]}"
    super do |resource|
      if resource.valid?
        resource.full_name = params[:user][:full_name]
        resource.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)